# Pandas

In [21]:
import pandas as pd

In [22]:
pd.Series([10, 20, 30, 40])       # 0,1,2,3 is a index and 10,20... are values

0    10
1    20
2    30
3    40
dtype: int64

In [23]:
pd.Series([11, 12, 13, 14, 15])

0    11
1    12
2    13
3    14
4    15
dtype: int64

In [24]:
a = pd.Series([11, 12, 13, 14, 15])

In [25]:
a

0    11
1    12
2    13
3    14
4    15
dtype: int64

In [26]:
pd.Series([11, 12, 13, 14, 15, 14, 11])  # we can put repeating element also

0    11
1    12
2    13
3    14
4    15
5    14
6    11
dtype: int64

indexing

In [27]:
a

0    11
1    12
2    13
3    14
4    15
dtype: int64

In [38]:
a[0]

11

In [40]:
a[1]

12

In [41]:
a[2]

13

In [42]:
a[4]

15

Slicing

In [44]:
a[0:2]

0    11
1    12
dtype: int64

In [45]:
a[0:4]

0    11
1    12
2    13
3    14
dtype: int64

In [46]:
a[3:5]

3    14
4    15
dtype: int64

In [48]:
a[2:]

2    13
3    14
4    15
dtype: int64

In [57]:
a[-1:-4:-1]    # negative slicing is not working on this pandas Series it's class says

4    15
3    14
2    13
dtype: int64

In [75]:
pd.Series? # their are many parameters are present in this pandas if we run this code
#  this code is working only that time when below cell is empty   if's my openion

SyntaxError: invalid syntax (214722556.py, line 1)

In [31]:
pd.Series([100, 200, 300, 400, 500],index=[1,2,3,4,5])   # here index is start in 1 because we put index start is 1

1    100
2    200
3    300
4    400
5    500
dtype: int64

In [32]:
import numpy as np
b = np.array([23,34,56,78])

pd.Series(data=b)

0    23
1    34
2    56
3    78
dtype: int32

In [33]:
pd.Series(data=b,index=[10,20,30,40])

10    23
20    34
30    56
40    78
dtype: int32

In [34]:
dict1 = {'id':1,'Name':'ABC','Age':14}
dict1

{'id': 1, 'Name': 'ABC', 'Age': 14}

In [35]:
pd.Series(data=dict1)

id        1
Name    ABC
Age      14
dtype: object

# DATAFRAME

In [61]:
data = [10,20,30,40,50]
a = pd.DataFrame(data)

In [62]:
a

    0
0  10
1  20
2  30
3  40
4  50

In [64]:
data = [[('Alex',10)],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data)
df                     # here, 3 rows and 2 coloum     coloum index me coloum 1 hai or row 2 hai

            0     1
0  (Alex, 10)   NaN
1         Bob  12.0
2      Clarke  13.0

In [65]:
data = [['Alex',10],['Bod',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print(df)

     Name  Age
0    Alex   10
1     Bod   12
2  Clarke   13

In [68]:
data = [['Alex',10],['Bod',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype='string')
print(df)

     Name Age
0    Alex  10
1     Bod  12
2  Clarke  13

In [69]:
data = [['Alex',10],['Bod',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
print(df)

     Name   Age
0    Alex  10.0
1     Bod  12.0
2  Clarke  13.0

C:\Users\sharm\AppData\Local\Temp\ipykernel_11216\536433695.py:2: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)

In [76]:
pd.DataFrame?

In [77]:
pd.Series?

In [81]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],index=['row1','row2','row3'])
print(df)

        Name  Age
row1    Alex   10
row2     Bob   12
row3  Clarke   13

In [80]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Student name','Student Age'],index=['first','second','third'])
print(df)

       Student name  Student Age
first          Alex           10
second          Bob           12
third        Clarke           13

In [82]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
print(df)

    Name   Age
0    Tom  28.0
1   Jack  34.0
2  Steve  29.0
3  Ricky  42.0

C:\Users\sharm\AppData\Local\Temp\ipykernel_11216\3335041979.py:2: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)

In [83]:
data = [['Alex',10,6000],['Bob',12,5590],['Clarke',13,4566]]
df = pd.DataFrame(data,columns=['Student name','Student Age','student fees'],index=['first','second','third'])
print(df)

       Student name  Student Age  student fees
first          Alex           10          6000
second          Bob           12          5590
third        Clarke           13          4566

In [84]:
data = [['Alex',10,6000],['Bob',12,5590],['Clarke',13,4566],['ABC',10,3333]]
df = pd.DataFrame(data,columns=['Student name','Student Age','student fees'],index=['first','second','third','fourth'])
print(df)

       Student name  Student Age  student fees
first          Alex           10          6000
second          Bob           12          5590
third        Clarke           13          4566
fourth          ABC           10          3333

In [85]:
mydata = [['Alex',10],['Bob',12],['Clarke',13]]    # if we use replay or data to any variable that time also work and we use below data = mydata that time also work
df = pd.DataFrame(data=mydata,columns=['Name','Age'],index=['row1','row2','row3'])
print(df)

        Name  Age
row1    Alex   10
row2     Bob   12
row3  Clarke   13

In [88]:
mydata = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(mydata,columns=['Name','Age'],index=['row1','row2','row3'])
print(df)

        Name  Age
row1    Alex   10
row2     Bob   12
row3  Clarke   13

In [92]:
dict2 = {'id':[1,2,3],'Name':['Harry','Smith','Jack'],'Age':[12,13,14]}
dict2

{'id': [1, 2, 3], 'Name': ['Harry', 'Smith', 'Jack'], 'Age': [12, 13, 14]}

In [93]:
k = pd.DataFrame(dict2)    # ye single value me work nhi krega agr name ek hi hota age ek hi hote to work nhi krta kuki yee ek data leta hai pura in the form of matrix 
k

   id   Name  Age
0   1  Harry   12
1   2  Smith   13
2   3   Jack   14

In [96]:
k['id']

0    1
1    2
2    3
Name: id, dtype: int64

In [97]:
k['Name']

0    Harry
1    Smith
2     Jack
Name: Name, dtype: object

In [100]:
data = {'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [102]:
# note = observe, NaN (Not a Number) is appended in missing areas.
data = [{'a':1, 'b':2},{'a':5, 'b':10,'c':20}]
df = pd.DataFrame(data,dtype=float)
print(df)

     a     b     c
0  1.0   2.0   NaN
1  5.0  10.0  20.0

In [103]:
data = [{'a':1, 'b':2},{'a':5, 'b':10,'c':20}]
df = pd.DataFrame(data,index=['first','second'],dtype=float)
print(df)

          a     b     c
first   1.0   2.0   NaN
second  5.0  10.0  20.0

In [104]:
data = [{'a':1, 'b':2},{'a':5, 'b':10,'c':20}]
# with two column indices, values same as dictionary keys
df1 = pd.DataFrame(data,index=['first','second'],columns=['a','b'])
print(df1)

        a   b
first   1   2
second  5  10

In [107]:
data = [{'a':1, 'b':2},{'a':5, 'b':10,'c':20}]
# with two column indices, values same as dictionary keys
df1 = pd.DataFrame(data,index=['first','second'],columns=['a','b1'])     # we cann't find b1 because it is not present our dict
print(df1)

        a  b1
first   1 NaN
second  5 NaN

In [116]:
data = [{'a':1, 'b':2},{'a':5, 'b':10,'c':20}]
# with two column indices with one index with other name
df2 = pd.DataFrame(data,index=['first','second'],columns=['a','b1'])
print(df2)

        a  b1
first   1 NaN
second  5 NaN

In [110]:
k

   id   Name  Age
0   1  Harry   12
1   2  Smith   13
2   3   Jack   14

In [111]:
k = pd.DataFrame(data=dict2,columns=['id','Name'])
k

   id   Name
0   1  Harry
1   2  Smith
2   3   Jack

In [112]:
k = pd.DataFrame(data=dict2,columns=['Name','Age'])
k

    Name  Age
0  Harry   12
1  Smith   13
2   Jack   14

In [114]:
k = pd.DataFrame(data=dict2,columns=['Name','Age','grade'])   # here, NaN value show because their was no present grade in our dict
k

    Name  Age grade
0  Harry   12   NaN
1  Smith   13   NaN
2   Jack   14   NaN

In [118]:
df = pd.DataFrame(np.random.randn(8,4),columns=['A','B','C','D'])
df

          A         B         C         D
0 -1.669370 -0.772356  0.599138  0.306977
1 -0.685944  0.767126  0.399563  0.675230
2  0.449081  1.023584 -0.305899 -0.633161
3 -0.329997 -0.811069 -1.491843 -0.997384
4  1.635966 -0.735619 -1.549691 -1.124293
5  0.306685  0.141610  1.324232  0.438780
6 -0.138212  0.815488  0.966620  0.892644
7  0.174959  2.685583 -0.096587 -0.277303

In [119]:
df.loc[:,'A']

0   -1.669370
1   -0.685944
2    0.449081
3   -0.329997
4    1.635966
5    0.306685
6   -0.138212
7    0.174959
Name: A, dtype: float64

In [120]:
df.loc[:,'B']

0   -0.772356
1    0.767126
2    1.023584
3   -0.811069
4   -0.735619
5    0.141610
6    0.815488
7    2.685583
Name: B, dtype: float64

In [122]:
df.loc['C':'D']

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [123]:
df.loc[:,['C','D']]

          C         D
0  0.599138  0.306977
1  0.399563  0.675230
2 -0.305899 -0.633161
3 -1.491843 -0.997384
4 -1.549691 -1.124293
5  1.324232  0.438780
6  0.966620  0.892644
7 -0.096587 -0.277303

In [124]:
df.loc[:,['B','C','D']]

          B         C         D
0 -0.772356  0.599138  0.306977
1  0.767126  0.399563  0.675230
2  1.023584 -0.305899 -0.633161
3 -0.811069 -1.491843 -0.997384
4 -0.735619 -1.549691 -1.124293
5  0.141610  1.324232  0.438780
6  0.815488  0.966620  0.892644
7  2.685583 -0.096587 -0.277303

In [127]:
df.iloc[:,0]   # i means index and we can check with index

0   -1.669370
1   -0.685944
2    0.449081
3   -0.329997
4    1.635966
5    0.306685
6   -0.138212
7    0.174959
Name: A, dtype: float64

In [128]:
df.iloc[0:4,0:3]    # 0:4 is a starting no coloum and 0:3 is end no of rows

          A         B         C
0 -1.669370 -0.772356  0.599138
1 -0.685944  0.767126  0.399563
2  0.449081  1.023584 -0.305899
3 -0.329997 -0.811069 -1.491843

In [129]:
df.iloc[2:6,0:2]

          A         B
2  0.449081  1.023584
3 -0.329997 -0.811069
4  1.635966 -0.735619
5  0.306685  0.141610

In [130]:
df.iloc[2:6,3]

2   -0.633161
3   -0.997384
4   -1.124293
5    0.438780
Name: D, dtype: float64

In [132]:
df.iloc[3:7,1:3]

          B         C
3 -0.811069 -1.491843
4 -0.735619 -1.549691
5  0.141610  1.324232
6  0.815488  0.966620

In [133]:
df.iloc[:,:]   # show all data

          A         B         C         D
0 -1.669370 -0.772356  0.599138  0.306977
1 -0.685944  0.767126  0.399563  0.675230
2  0.449081  1.023584 -0.305899 -0.633161
3 -0.329997 -0.811069 -1.491843 -0.997384
4  1.635966 -0.735619 -1.549691 -1.124293
5  0.306685  0.141610  1.324232  0.438780
6 -0.138212  0.815488  0.966620  0.892644
7  0.174959  2.685583 -0.096587 -0.277303

In [134]:
df.iloc[:,1]

0   -0.772356
1    0.767126
2    1.023584
3   -0.811069
4   -0.735619
5    0.141610
6    0.815488
7    2.685583
Name: B, dtype: float64

In [135]:
df.iloc[:,3]  # all rows with third coloum

0    0.306977
1    0.675230
2   -0.633161
3   -0.997384
4   -1.124293
5    0.438780
6    0.892644
7   -0.277303
Name: D, dtype: float64

In [136]:
df.iloc[:,2]

0    0.599138
1    0.399563
2   -0.305899
3   -1.491843
4   -1.549691
5    1.324232
6    0.966620
7   -0.096587
Name: C, dtype: float64

In [137]:
df.iloc[0,0]

-1.6693698758629627

In [138]:
df.iloc[:,2:]

          C         D
0  0.599138  0.306977
1  0.399563  0.675230
2 -0.305899 -0.633161
3 -1.491843 -0.997384
4 -1.549691 -1.124293
5  1.324232  0.438780
6  0.966620  0.892644
7 -0.096587 -0.277303

In [140]:
df.iloc[:,2:4]

          C         D
0  0.599138  0.306977
1  0.399563  0.675230
2 -0.305899 -0.633161
3 -1.491843 -0.997384
4 -1.549691 -1.124293
5  1.324232  0.438780
6  0.966620  0.892644
7 -0.096587 -0.277303

In [141]:
df.iloc[0:5,0:2]

          A         B
0 -1.669370 -0.772356
1 -0.685944  0.767126
2  0.449081  1.023584
3 -0.329997 -0.811069
4  1.635966 -0.735619

In [142]:
df.iloc[3:7,0:3]

          A         B         C
3 -0.329997 -0.811069 -1.491843
4  1.635966 -0.735619 -1.549691
5  0.306685  0.141610  1.324232
6 -0.138212  0.815488  0.966620

In [143]:
df.iloc[4:6]

          A         B         C         D
4  1.635966 -0.735619 -1.549691 -1.124293
5  0.306685  0.141610  1.324232  0.438780

In [148]:
df.iloc[4:6,1:3]

          B         C
4 -0.735619 -1.549691
5  0.141610  1.324232

In [149]:
df.iloc[0:,0:]   # show all data

          A         B         C         D
0 -1.669370 -0.772356  0.599138  0.306977
1 -0.685944  0.767126  0.399563  0.675230
2  0.449081  1.023584 -0.305899 -0.633161
3 -0.329997 -0.811069 -1.491843 -0.997384
4  1.635966 -0.735619 -1.549691 -1.124293
5  0.306685  0.141610  1.324232  0.438780
6 -0.138212  0.815488  0.966620  0.892644
7  0.174959  2.685583 -0.096587 -0.277303

In [150]:
df.iloc[:7,:3]

          A         B         C
0 -1.669370 -0.772356  0.599138
1 -0.685944  0.767126  0.399563
2  0.449081  1.023584 -0.305899
3 -0.329997 -0.811069 -1.491843
4  1.635966 -0.735619 -1.549691
5  0.306685  0.141610  1.324232
6 -0.138212  0.815488  0.966620